server/test/load-test.yml
config:
  target: 'http://localhost:3002'
  phases:
    - duration: 60
      arrivalRate: 20
      name: Startup phase
    - duration: 60
      arrivalRate: 60
      name: Intermediate phase
    - duration: 60
      arrivalRate: 110
      name: Peak phase
    - duration: 60
      arrivalRate: 2
      name: Slow down phase
  plugins:
    ensure: {}
    expect: {}
  ensure:
    thresholds:
      - http.response_time.max: 1000

scenarios:
  - flow:
    - get:
        url: "/"